{"inkVersion":20,"root":[["^Hey! Are you Mick?","\n","^Mick: Yes it's me, but who are you?","\n","^I am an adventurer and I want to help your village. Chief sent me here. Can you tell me where the creatures' lairs are?","\n","^Mick: This is actually a complex issue. There is only one place we are sure of. We have hints for other places, but no definite information. Maybe cleaning this first place will give us better","\n","^...tips.","\n","^That's what I'm here for.","\n","^Mick: It's good that you're so confident.","\n","^Mick: On the north side of this forest there is an abandoned house with a green roof. Creatures have been seen coming from there at night. The house is too small for that many creatures","\n","^...but we guess there are tunnels underground.","\n",["ev",{"^->":"0.18.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-0","flg":18},{"s":["^Is there any other tip you want to give?",{"->":"$r","var":true},null]}],["ev",{"^->":"0.19.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-1","flg":18},{"s":["^Do you think anyone wants to join me?",{"->":"$r","var":true},null]}],["ev",{"^->":"0.20.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-2","flg":18},{"s":["^Would you be interested in joining me?",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"0.18.s"},[{"#n":"$r2"}],"\n","^Mick: You can go to the store next to that building and shop. That will make you stronger.","\n",{"->":"0.g-0"},{"#f":5}],"c-1":["ev",{"^->":"0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":"0.19.s"},[{"#n":"$r2"}],"\n","^Mick: Unfortunately, there is no one in this village who dares to go there. But to get stronger, you can go to the store next to that building and shop.","\n",{"->":"0.g-0"},{"#f":5}],"c-2":["ev",{"^->":"0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":"0.20.s"},[{"#n":"$r2"}],"\n","^Mick: Hahaha, are you scared? I'm not that brave either. If you think you are not strong enough to do this you can go to the store next to that building and shop. That will make you stronger.","\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}